notes/talks/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Talks</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Talks</h1>
</header>
<div id="outline-container-home-cooked-software" class="outline-2">
<h2 id="home-cooked-software"><a href="#home-cooked-software">Home-cooked Software: A Backup Tale</a></h2>
<div class="outline-text-2" id="text-home-cooked-software">
<ul class="org-ul">
<li><a href="https://www.linuxtage.at/en">Grazer Linuxtage</a> (<a href="https://media.ccc.de/v/glt25-512-home-cooked-software-a-backup-tale">media.ccc.de</a> &amp; <a href="https://www.youtube.com/watch?v=iLKW6-UIvTM">youtube.com</a>) <span class="timestamp-wrapper"><span class="timestamp">[2025-04-26 Sat]</span></span></li>
<li><a href="https://github.com/fwinkelbauer/fwinkelbauer.github.io/tree/main/conference-material/home-cooked-software">Slides</a></li>
</ul>

<p>
<a href="https://github.com/fwinkelbauer/chunkyard">Chunkyard</a> is a backup tool that I have been building for myself over the last
five years. It's a hobby project with which I can follow my curiosity to learn
and enjoy different aspects of software development. Since I am the only real
user, I can do whatever I feel like. In this talk I am going to share what I
have learned over the years while building this tiny piece of "home-cooked
software". Stories include:
</p>

<ul class="org-ul">
<li>Learning more about encryption, content-defined chunking and
content-addressable storage</li>
<li>Doing "stupid" things like using a text editor and a terminal instead of an
IDE</li>
<li>Deepening my knowledge about automated tests by going "all in"</li>
<li>Building my own command line parser just for fun</li>
<li>Complaining about performance because I have no idea how computers work</li>
<li>That C# is a decent language/environment, even on Linux</li>
<li>The joy and fulfilment that hobby projects can give</li>
</ul>
</div>
</div>

<div id="outline-container-automated-unit-tests" class="outline-2">
<h2 id="automated-unit-tests"><a href="#automated-unit-tests">Automated Unit Tests: The Hard Parts</a></h2>
<div class="outline-text-2" id="text-automated-unit-tests">
<ul class="org-ul">
<li><a href="https://www.devopsdays.at">DevOpsDays Graz</a> <span class="timestamp-wrapper"><span class="timestamp">[2025-09-05 Fri]</span></span></li>
<li><a href="https://www.developer-world.de/ddc">DDC Cologne</a> <span class="timestamp-wrapper"><span class="timestamp">[2025-11-27 Thu]</span></span></li>
<li><a href="https://github.com/fwinkelbauer/fwinkelbauer.github.io/tree/main/conference-material/automated-unit-tests-hard-parts">Slides</a></li>
</ul>

<p>
The introduction tutorials for automated test frameworks make it look so easy.
Write some code, write a few tests and you're done. But when dealing with
production code we often run into problems and learn, that the real world is
different. This workshop explores challenges and solutions to create a suite of
automated tests in C#:
</p>

<ul class="org-ul">
<li>Learn new aspects of how to think about code</li>
<li>Try different testing strategies</li>
<li>Explore techniques to make tests readable and fun</li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
<p>© 2026 Florian Winkelbauer</p>
</footer>
</div>
</body>
</html>
